app/Controllers/Rekap.php

    public function index()
    {
        $data['data']=[
            'menu' => 'Rekap Data',
            'title' => 'Rekap Data',
        ];

        $data ['datarekap'] = $this->rekap->findAll();
---
SELECT *
FROM `data_rekap`

    public function simpan()
    {
        $getRule = $this->rekap->getRule();
        $this->rekap->setValidationRules($getRule);

        $dtrekap=[
            'id_rekap'      => $this->request->getPost('id_rekap'),
            'ket'           => $this->request->getPost('ket'),
            'nomin'         => $this->request->getPost('nomin'),
            'pemba'         => $this->request->getPost('pemba'),
            'penja'         => $this->request->getPost('penja'),
        ];

        if(!$this->rekap->insert($dtrekap)) {
---
INSERT INTO `data_rekap` (`ket`, `nomin`, `pemba`, `penja`) VALUES ('11111', '111111', '11111', '111111')

    public function edit($id)
    {
        $data['data'] = [
            'menu'  => '',
            'title' => 'Ubah Data Penerbit',
        ];

        $data ['datarekap'] = $this->rekap->where('id_rekap', $id)->first();
---
SELECT *
FROM `data_rekap`
WHERE `id_rekap` = '18'
 LIMIT 1

    public function update($id)
    {
        $getRule = $this->rekap->getRule();
        $this->rekap->setValidationRules($getRule);

        $dtrekap=[
            'id_rekap'      => $this->request->getVar('id_rekap'),
            'ket'    => $this->request->getVar('ket'),
            'nomin'       => $this->request->getVar('nomin'),
            'pemba'    => $this->request->getVar('pemba'),
            'penja'            => $this->request->getVar('penja'),
        ];

        if (!$this->rekap->update($id ,$dtrekap)) {
---
UPDATE `data_rekap` SET `ket` = '33333', `nomin` = '111111', `pemba` = '11111', `penja` = '111111'
WHERE `data_rekap`.`id_rekap` IN ('18')