app/Controllers/User.php

SELECT *
FROM `data_user`
---
    public function index()
    {
        $data ['data'] = [
            'menu'  => 'Data User',
            'title' => 'Data User',

        ];
        $data['datauser'] = $this->user->findAll();